SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
CREATE PROCEDURE [dbo].[счф_и] (@счф_док   INT,
                               @счф_дата  DATE,
                               @счф_сум   numeric(12,2),
                               @счф_ном   INT,
                               @счф_сут   INT,
                               @опл_дата  DATE,
                               @опл_док   VARCHAR(50),
                               @счф_цена  numeric(12,2),
                               @счф_инф   VARCHAR(50),
                               @дог_код   INT,
                               @дата_с    DATE,
                               @дата_по   DATE,
                               @счф_ски   numeric(12,2),
                               @счф_итого numeric(12,2),
                               @счф_код   INT)
AS
  SET NOCOUNT OFF;

  UPDATE [счф]
  SET    [счф_док] = @счф_док,
         [счф_дата] = @счф_дата,
         [счф_сум] = @счф_сум,
         [счф_ном] = @счф_ном,
         [счф_сут] = @счф_сут,
         [опл_дата] = @опл_дата,
         [опл_док] = @опл_док,
         [счф_цена] = @счф_цена,
         [счф_инф] = @счф_инф,
         [дог_код] = @дог_код,
         [дата_с] = @дата_с,
         [дата_по] = @дата_по,
         [счф_ски] = @счф_ски,
         [счф_итого] = @счф_итого
  WHERE  [счф_код] = @счф_код;
GO