SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
CREATE PROCEDURE [dbo].[кли_о]
(
	@кли_код int
)
AS
	SET NOCOUNT ON;
SELECT
  кли.кли_код,
  isnull(кли.фам,'') as фам ,
  isnull(кли.имя,'') as имя,
 isnull( кли.отч,'') as отч,
  кли.пол,
  кли.рожд_дата,
  кли.рожд_место,
  кли.гражд_код,
  кли.рег,
  кли.раб_место,
  кли.раб_должность,
  кли.раб_ком_уд,
  кли.раб_прибыл,
  кли.пас_вид_код,
  кли.пас_номер,
  кли.пас_дата,
  кли.пас_дата_по,
  кли.пас_выдан,
  кли.адр_страна_код,
  кли.адр_город,
  кли.адрес,
  кли.телефон,
  кли.е_маил,
  кли.авто_марка,
  кли.авто_номер,
  кли.инф_кли,
  кли.виза_вид_код,
  кли.виза_сер,
  кли.виза_номер,
  кли.виза_дата_с,
  кли.виза_дата_по,
  кли.страх_стр_код,
  кли.страх_кем_код,
  кли.страх_номер,
  кли.страх_дата_с,
  кли.страх_дата_по,
  кли.миг_карта,
  кли.миг_карта_дата_с,
  кли.миг_карта_дата_по,
  кли.скид_карта,
  кли.скид_проц,
  кли.гра_дата,
  кли.гра_код,
  кли.фам_лат,
  кли.имя_лат,
  кли.отч_лат,
  кли.дата_соз,
  кли.дата_изм,
  isnull(v_кли_кол_зае_сум.кол,0) as кол,
  isnull(v_кли_кол_зае_сум.сут,0) as сут
FROM
  кли
LEFT OUTER JOIN v_кли_кол_зае_сум
  ON кли.кли_код = v_кли_кол_зае_сум.кли_код 

WHERE           ( кли.кли_код = @кли_код )
GO