SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
-- =============================================
-- Author:		MAG
-- Create date: 2011-08-15
-- Description:	учитывает преселение и по ном и по суммам в номере
-- =============================================
CREATE PROCEDURE [dbo].[о_нач_акт_табл]
	-- Add the parameters for the stored procedure here
	@счет_код INT
AS
BEGIN
	SET NOCOUNT ON;

	IF EXISTS (
			SELECT *
			FROM sys.objects
			WHERE object_id = Object_id(N'[dbo].[я_нач_акт_табл]')
				AND TYPE IN (N'U')
			)
		DROP TABLE [dbo].[я_нач_акт_табл]

	SELECT
		-- ОБЩЕЕ ПО СЧЕТУ
		во_счет.*
		,
		-- итоги по документу 
		Фт_нач_опл_сум_1.сум_пропись
		,Фт_нач_опл_сум_1.сут AS сут_сум
		,Фт_нач_опл_сум_1.ски_сум
		,Фт_нач_опл_сум_1.нач_сум
		,Фт_нач_опл_сум_1.всего_сум
		-- В ДЕТАЛИ РАЗНЫЕ ВАРИАНТЫ
		,dbo.Фс_гра_пол(во_кли.кли_код) AS гра_пол
		,dbo.Фс_гра_стр(во_кли.кли_код) AS гра_стр
		,dbo.Фс_кли_имя_граж_срок(во_кли.счет_код, во_кли.кли_код) AS граж_срок
		,
		-- во_кли
		во_кли.кли_код
		,во_кли.дата_зае
		,во_кли.дата_вые
		,во_кли.сут
		,во_кли.ном_код
		,dbo.Фс_фам_ио(во_кли.кли_код) AS фам_ио
		,dbo.Фс_фио(во_кли.кли_код) AS фио
		,
		-- суммы
		во_кли.нач_сум_о
		,во_кли.ски_сум_о
		,(во_кли.нач_сум_о + во_кли.ски_сум_о) AS всего_сум_o
	INTO я_нач_акт_табл
	FROM dbo.Фт_нач_опл_сум(@счет_код) AS Фт_нач_опл_сум_1
	RIGHT OUTER JOIN во_кли ON Фт_нач_опл_сум_1.счет_код = во_кли.счет_код
	LEFT OUTER JOIN во_счет ON во_кли.счет_код = во_счет.счет_код
	WHERE во_кли.счет_код = @счет_код
END
GO