SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
CREATE PROCEDURE [dbo].[опер_о] (@опер_код INT)
AS
  SET NOCOUNT ON;

  SELECT
    опер_код,
    ном_код,
    дата_зае,
    кли_код,
    счет_код,
    дата_вые,
    дата_вые_факт,
    Isnull(сут, 0) AS сут,
    Isnull(сут_факт, 0) AS сут_факт,
    Isnull(пол_сут_зае, 0) AS пол_сут_зае,
    Isnull(пол_сут_вые, 0) AS пол_сут_вые,
    Isnull(сут_дни, 0) AS сут_дни,
    Isnull(сут_пол, 0) AS сут_пол,
    кол_взр,
    кол_дет,
    рег,
    тип_зае_код,
    цель_код,
    ски_код,
    ски_про,
    цена,
    цена_изм,
    инф_зае,
    инф_вые,
    раб_место,
    раб_должность,
    раб_ком_уд,
    раб_прибыл,
    виза_вид_код,
    виза_сер,
    виза_номер,
    виза_дата_с,
    виза_дата_по,
    страх_кем_код,
    страх_номер,
    страх_дата_с,
    страх_дата_по,
    миг_карта,
    миг_карта_дата_с,
    миг_карта_дата_по,
    гра_дата,
    гра_код,
    дата_соз,
    дата_изм
  FROM
    опер
  WHERE  опер_код = @опер_код
GO