SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
-- =============================================
-- Author:		MAG
-- Create date: 2011-05-22
-- Description:	 переселение из номера в номер
-- =============================================
CREATE PROCEDURE [dbo].[ном_пере]
-- Add the parameters for the stored procedure here
@з_опер_код INT,
@п_ном_код  INT,
@з_ном_код  INT,
@дата_пере  DATE,
@инф_вые    TEXT
AS
  BEGIN
      -- всего три даты
      -- зае - пере - вые
      DECLARE @RC INT;
      DECLARE @есть_опер INT;
      DECLARE @п_опер_код INT;
      DECLARE @ном_код INT;
      DECLARE @кли_код INT;
      DECLARE @дата_зае DATE; -- 
      DECLARE @дата_вые DATE; -- старая дата выезда
      DECLARE @мест INT;
      DECLARE @дкр DECIMAL(10, 0);
      DECLARE @пол_cут INT;
      DECLARE @ски_про INT;
      DECLARE @ски_код INT;
      DECLARE @цена INT;
        DECLARE @цена_изм  bit; 

      SELECT
        @ном_код = ном_код,
        @кли_код = кли_код,
        @дата_зае = дата_зае,
        @дата_вые = дата_вые,
        @мест = кол_взр,
        @дкр = кол_дет,
        @пол_cут = 0,
        @ски_про = ски_про,
        @ски_код = ски_код,
        @цена = Isnull(цена, 0),
        @цена_изм  = Isnull(цена_изм, 0)
      FROM
        опер
      WHERE  опер_код = @з_опер_код;

      -- выселение- Опер- испр даты
      UPDATE опер
      SET    сут = Datediff(D, опер.дата_зае, @дата_пере),
             дата_вые = @дата_пере,
             инф_вые = Isnull(@инф_вые, '')
      WHERE  опер_код = @з_опер_код;

      -- нач испр записей нач
      -- 
      EXECUTE @RC = [dbo].[Нач_ген]
        @з_опер_код,
        @ном_код,
        @дата_зае,
        @дата_пере,
        @мест,
        @дкр,
        @пол_cут,
        @ски_про,
        @ски_код,
        @цена,
        0 -- цена высчитаввыется от суток и номера

      -- заселение
      -- если повторно сделать переселение
      DELETE FROM опер
      WHERE  ном_код = @п_ном_код
         AND дата_зае = @дата_пере
         AND кли_код = @кли_код

      SELECT
        @цена = dbo.Фс_ном_цена(@п_ном_код, @дата_пере, 1, @мест);

      INSERT INTO опер
                  (ном_код,
                   дата_зае,
                   кли_код,
                   счет_код,
                   дата_вые,
                   дата_вые_факт,
                   сут,
                   кол_взр,
                   кол_дет,
                   тип_зае_код,
                   цель_код,
                   ски_код,
                   ски_про,
                   инф_зае,
                   инф_вые,
                   раб_место,
                   раб_должность,
                   раб_ком_уд,
                   раб_прибыл,
                   виза_вид_код,
                   виза_сер,
                   виза_номер,
                   виза_дата_с,
                   виза_дата_по,
                   страх_кем_код,
                   страх_номер,
                   страх_дата_с,
                   страх_дата_по,
                   миг_карта,
                   миг_карта_дата_с,
                   миг_карта_дата_по,
                   гра_дата,
                   гра_код,
                   цена)
      SELECT
        @п_ном_код,
        @дата_пере,
        кли_код,
        счет_код,
        @дата_вые,
        @дата_вые /*дата_вые_факт*/,
        Datediff(D, @дата_пере, @дата_вые) /*сут*/,
        кол_взр,
        кол_дет,
        тип_зае_код,
        цель_код,
        ски_код,
        ски_про,
        'переселение ' + Rtrim(CONVERT (CHAR(15), @дата_пере, 104)) + ' из номера ' + CONVERT (CHAR(15), @з_ном_код)
        /*инф_зае*/,
        '',/*инф_вые*/
        раб_место,
        раб_должность,
        раб_ком_уд,
        раб_прибыл,
        виза_вид_код,
        виза_сер,
        виза_номер,
        виза_дата_с,
        виза_дата_по,
        страх_кем_код,
        страх_номер,
        страх_дата_с,
        страх_дата_по,
        миг_карта,
        миг_карта_дата_с,
        миг_карта_дата_по,
        гра_дата,
        гра_код,
        @цена
      FROM
        опер AS опер_1
      WHERE  опер_код = @з_опер_код

      SET @п_опер_код = Scope_identity()

      -- расчет нач Пере
      EXECUTE @RC = [dbo].[Нач_ген]
        @п_опер_код,
        @п_ном_код,
        @дата_пере,
        @дата_вые,
        @мест,
        @дкр,
        @пол_cут,
        @ски_про,
        @ски_код,
        @цена,
         0 -- цена высчитаввыется от суток и номера
  END
GO