SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
create  PROCEDURE [dbo].[кли_опер_и] (@опер_код          int,
 @кли_код           INT)
as
 declare                        @раб_место         CHAR(30)
  declare                        @раб_должность     CHAR(30)
  declare                       @раб_ком_уд        CHAR(30)
  declare                       @раб_прибыл        CHAR(30)
         declare                @рег int
                    
                 declare        @виза_вид_код      INT
                        declare @виза_сер          CHAR(3)
                        declare @виза_номер        CHAR(30)
 declare                        @виза_дата_с       DATE
 declare                        @виза_дата_по      DATE
                      
 declare                        @страх_кем_код     INT
declare                         @страх_номер       CHAR(30)
declare                        @страх_дата_с      DATE
 declare                        @страх_дата_по     DATE
                       
declare                         @миг_карта         CHAR(30)
declare                         @миг_карта_дата_с  DATE
declare                         @миг_карта_дата_по DATE
                      
declare                         @гра_дата          DATE
declare                         @гра_код           INT

  SET NOCOUNT OFF;

  SELECT @раб_место = раб_место,
         @раб_должность = раб_должность,
         @раб_ком_уд = раб_ком_уд,
         @раб_прибыл = раб_прибыл,
      
         @рег = рег,
   
         @виза_вид_код = виза_вид_код,
         @виза_сер = виза_сер,
         @виза_номер = виза_номер,
         @виза_дата_с = виза_дата_с,
         @виза_дата_по = виза_дата_по,
        
         @страх_кем_код = страх_кем_код,
         @страх_номер = страх_номер,
         @страх_дата_с = страх_дата_с,
         @страх_дата_по = страх_дата_по,
       
         @миг_карта = миг_карта,
         @миг_карта_дата_с = миг_карта_дата_с,
         @миг_карта_дата_по = миг_карта_дата_по,
     
         @гра_дата = гра_дата,
         @гра_код = гра_код
  FROM   кли
  WHERE  кли.кли_код = @кли_код

  UPDATE [опер]
  SET   
         [раб_место] = @раб_место,
         [раб_должность] = @раб_должность,
         [раб_ком_уд] = @раб_ком_уд,
         [раб_прибыл] = @раб_прибыл,
     
         [рег] = @рег,
         
         [виза_вид_код] = @виза_вид_код,
         [виза_сер] = @виза_сер,
         [виза_номер] = @виза_номер,
         [виза_дата_с] = @виза_дата_с,
         [виза_дата_по] = @виза_дата_по,
        
         [страх_кем_код] = @страх_кем_код,
         [страх_номер] = @страх_номер,
         [страх_дата_с] = @страх_дата_с,
         [страх_дата_по] = @страх_дата_по,
       
         [миг_карта] = @миг_карта,
         [миг_карта_дата_с] = @миг_карта_дата_с,
         [миг_карта_дата_по] = @миг_карта_дата_по,
         
         [гра_дата] = @гра_дата,
         [гра_код] = @гра_код
  
  WHERE   [опер_код] = @опер_код ;
GO