SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
CREATE PROCEDURE [dbo].[пара_и] (@комп_код          INT,
                                @дата_зае_г        DATETIME,
                                @дата_вые_г        DATETIME,
                                @сут_г             INT,
                                @тип_зае_код_г     INT,
                                @кол_взр_г         INT,
                                @цель_код_г        INT,
                                @ски_код_г         INT,
                                @ски_про_г         INT,
                                @счет_код_г        INT
                              )
AS
  SET NOCOUNT OFF;

  UPDATE [пара]
  SET    [комп_код] = @комп_код,
         [дата_зае_г] = @дата_зае_г,
         [дата_вые_г] = @дата_вые_г,
         [сут_г] = @сут_г,
         [тип_зае_код_г] = @тип_зае_код_г,
         [кол_взр_г] = @кол_взр_г,
         [цель_код_г] = @цель_код_г,
         [ски_код_г] = @ски_код_г,
         [ски_про_г] = @ски_про_г,
         [счет_код_г] = @счет_код_г
        
  WHERE  (( [комп_код] = @комп_код ));

  SELECT
    комп_код,
    дата_зае_г,
    дата_вые_г,
    сут_г,
    тип_зае_код_г,
    кол_взр_г,
    цель_код_г,
    ски_код_г,
    ски_про_г,
    счет_код_г
  
  FROM
    пара
  WHERE  ( комп_код = @комп_код )
GO