SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
CREATE PROCEDURE [dbo].[орг_и]
(
	@орг_имя varchar(300),
	@орг_имя_кор varchar(300),
	@орг_имя_пол varchar(300),
	@преамбула varchar(300),
	@счет_номер char(30),
	@счет_банк char(30),
	@счет_мфо char(30),
	@унп char(15),
	@адрес varchar(100),
	@город char(30),
	@стр_код int,
	@рук_фио_кор char(30),
	@рук_фио_пол char(30),
	@рук_должность char(30),
	@дейст_на_осн varchar(300),
	@тел_рук char(50),
	@контакт_фио char(30),
	@тел_контакт char(50),
	@тел_гор char(15),
	@тел_факс char(15),
	@тел_velcom char(15),
	@тел_mtc char(15),
	@тел_life char(15),
	@е_маил char(30),
	@original_орг_код int,
	@орг_код int
)
AS
	SET NOCOUNT OFF;
UPDATE [орг] SET [орг_имя] = @орг_имя, [орг_имя_кор] = @орг_имя_кор, [орг_имя_пол] = @орг_имя_пол, [преамбула] = @преамбула, [счет_номер] = @счет_номер, [счет_банк] = @счет_банк, [счет_мфо] = @счет_мфо, [унп] = @унп, [адрес] = @адрес, [город] = @город, [стр_код] = @стр_код, [рук_фио_кор] = @рук_фио_кор, [рук_фио_пол] = @рук_фио_пол, [рук_должность] = @рук_должность, [дейст_на_осн] = @дейст_на_осн, [тел_рук] = @тел_рук, [контакт_фио] = @контакт_фио, [тел_контакт] = @тел_контакт, [тел_гор] = @тел_гор, [тел_факс] = @тел_факс, [тел_Velcom] = @тел_Velcom, [тел_MTC] = @тел_MTC, [тел_Life] = @тел_Life, [е_маил] = @е_маил WHERE (([орг_код] = @Original_орг_код));
	
SELECT орг_код, орг_имя, орг_имя_кор, орг_имя_пол, преамбула, счет_номер, счет_банк, счет_мфо, унп, адрес, город, стр_код, рук_фио_кор, рук_фио_пол, рук_должность, дейст_на_осн, тел_рук, контакт_фио, тел_контакт, тел_гор, тел_факс, тел_Velcom, тел_MTC, тел_Life, е_маил FROM орг WHERE (орг_код = @орг_код)
GO