SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
CREATE PROCEDURE [dbo].[нач_о] (@счет_код INT)
AS
  SET NOCOUNT ON;

SELECT dbo.Фс_опер_имя(нач.опер_код) AS опер_имя,
        нач.дата,
        нач.мест,
        нач.дкр,
        нач.кол,
        нач.сут,
        нач.ски_код,
        нач.ски_про,
        Isnull(нач.про_сум, 0)        AS про_сум,
        Isnull(нач.дкр_сум, 0)        AS дкр_сум,
        Isnull(нач.тел_сум, 0)        AS тел_сум,
        
        /*Isnull(нач.бар_сум, 0)*/
        dbo.Фс_бар_сумма_счет_день(нач.опер_код,нач.дата)
        
                AS бар_сум,
        
        Isnull(нач.ски_сум, 0)        AS ски_сум,
        Isnull(нач.у_1_сум, 0)        AS у_1_сум,
        Isnull(нач.у_2_сум, 0)        AS у_2_сум,
        Isnull(нач.у_3_сум, 0)        AS у_3_сум,
        Isnull(нач.нач_сум, 0)        AS нач_сум,
        нач.инф_нач,
        нач.опер_код,
        нач.нач_код,
        опер.ном_код,
        опер.кли_код,
        опер.дата_зае,
     /*  Isnull( нач.бл,'false') as бл */
      Isnull( нач.бл,0) as бл 
      
       
 FROM   нач
        INNER JOIN опер
          ON нач.опер_код = опер.опер_код
 WHERE  ( опер.счет_код = @счет_код )
GO