SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO

-- =============================================
-- Author:		МАГ
-- Create date:
-- Description:
-- =============================================
CREATE PROCEDURE [dbo].[Отчеты_Стат_4_тур_Таблица_3]
	-- отбор по дому и сортировка
	@Дата_с DATE
	, @Дата_по DATE
	, @Орг_Хоз_код INT
AS
BEGIN
	-- SET NOCOUNT ON added to prevent extra result sets from
	-- interfering with SELECT statements.
	SET NOCOUNT ON;

	IF EXISTS (
			SELECT *
			FROM sys.objects
			WHERE object_id = Object_id(N'[dbo].[я_Стат_4_тур_Таблица_3]')
				AND TYPE IN (N'U')
			)
		DROP TABLE [dbo].[я_Стат_4_тур_Таблица_3]

	DECLARE @TempTable TABLE (
		[Показатель] [char](200) NULL
		, [Код строки] [int] NULL
		, [Выручка] [numeric](20, 2) NULL
		, [Человек] [numeric](20, 1) NULL
		, [койко_суток] [numeric](20, 1) NULL
		, [орг_имя_хоз] [char](200) NULL
		)

	INSERT INTO @TempTable
	SELECT TOP (100) PERCENT 'Всего ' AS 'Показатель'
		, 301 AS 'Код строки'
		, SUM(фт_нач_опер_период_1.нач_сум) AS Выручка
		, SUM(фт_нач_опер_период_1.кол) AS Человек
		, SUM(фт_нач_опер_период_1.койко_суток) AS койко_суток
		, MAX(орг_хоз.орг_имя) AS орг_имя_хоз
	FROM кли
	INNER JOIN опер
		ON кли.кли_код = опер.кли_код
	INNER JOIN стр
		ON кли.гражд_код = стр.стр_код
	LEFT JOIN счет
	LEFT JOIN орг_хоз
		ON счет.орг_хоз_код = орг_хоз.орг_код
			ON опер.счет_код = счет.счет_код RIGHT JOIN dbo.фт_нач_опер_период(@Дата_с, @Дата_по) AS фт_нач_опер_период_1
			ON опер.опер_код = фт_нач_опер_период_1.опер_код GROUP BY счет.орг_хоз_код
	HAVING (счет.орг_хоз_код = @Орг_Хоз_код)

	INSERT INTO @TempTable
	SELECT TOP (100) PERCENT MAX(DISTINCT CASE 
				WHEN стр.стр_код = 1
					THEN 'Граждан Республики Беларусь '
				ELSE 'Граждан из других государств, всего '
				END) AS Показатель
		, MAX(DISTINCT CASE 
				WHEN стр.стр_код = 1
					THEN 302
				ELSE 303
				END) AS [Код строки]
		, SUM(фт_нач_опер_период_1.нач_сум) AS Выручка
		, SUM(фт_нач_опер_период_1.кол) AS Человек
		, SUM(фт_нач_опер_период_1.койко_суток) AS койко_суток
		, MAX(орг_хоз.орг_имя) AS орг_имя_хоз
	FROM кли
	INNER JOIN опер
		ON кли.кли_код = опер.кли_код
	INNER JOIN стр
		ON кли.гражд_код = стр.стр_код
	LEFT JOIN счет
	LEFT JOIN орг_хоз
		ON счет.орг_хоз_код = орг_хоз.орг_код
			ON опер.счет_код = счет.счет_код RIGHT JOIN dbo.фт_нач_опер_период(@Дата_с, @Дата_по) AS фт_нач_опер_период_1
			ON опер.опер_код = фт_нач_опер_период_1.опер_код GROUP BY счет.орг_хоз_код
			, CASE 
				WHEN стр.стр_код = 1
					THEN 1
				ELSE 0
				END
	HAVING (счет.орг_хоз_код = @Орг_Хоз_код)
	ORDER BY [Код строки]

	INSERT INTO @TempTable
	SELECT TOP (100) PERCENT MAX(DISTINCT CASE 
				WHEN ISNULL(стр.СНГ, 0) = 1
					THEN 'из стран СНГ, всего '
				ELSE 'из стран вне СНГ, всего '
				END) AS Показатель
		, CASE 
			WHEN ISNULL(стр.СНГ, 0) = 1
				THEN 304
			ELSE 309
			END AS [Код строки]
		, SUM(фт_нач_опер_период_1.нач_сум) AS Выручка
		, SUM(фт_нач_опер_период_1.кол) AS Человек
		, SUM(фт_нач_опер_период_1.койко_суток) AS койко_суток
		, MAX(орг_хоз.орг_имя) AS орг_имя_хоз
	FROM кли
	INNER JOIN опер
		ON кли.кли_код = опер.кли_код
	INNER JOIN стр
		ON кли.гражд_код = стр.стр_код
	LEFT JOIN счет
	LEFT JOIN орг_хоз
		ON счет.орг_хоз_код = орг_хоз.орг_код
			ON опер.счет_код = счет.счет_код RIGHT JOIN dbo.фт_нач_опер_период(@Дата_с, @Дата_по) AS фт_нач_опер_период_1
			ON опер.опер_код = фт_нач_опер_период_1.опер_код GROUP BY счет.орг_хоз_код
			, CASE 
				WHEN ISNULL(стр.СНГ, 0) = 1
					THEN 304
				ELSE 309
				END
			, CASE 
				WHEN стр.стр_код = 1
					THEN 1
				ELSE 0
				END
	HAVING (счет.орг_хоз_код = @Орг_Хоз_код)
		AND (
			CASE 
				WHEN стр.стр_код = 1
					THEN 1
				ELSE 0
				END <> 1
			)
	ORDER BY [Код строки]

	INSERT INTO @TempTable
	SELECT TOP (100) PERCENT стр.стр_имя AS Показатель
		, стр.Стр_Код_Стат_4_тур AS [Код строки]
		, SUM(фт_нач_опер_период_1.нач_сум) AS Выручка
		, SUM(фт_нач_опер_период_1.кол) AS Человек
		, SUM(фт_нач_опер_период_1.койко_суток) AS койко_суток
		, MAX(орг_хоз.орг_имя) AS орг_имя_хоз
	FROM кли
	INNER JOIN опер
		ON кли.кли_код = опер.кли_код
	INNER JOIN стр
		ON кли.гражд_код = стр.стр_код
	LEFT JOIN счет
	LEFT JOIN орг_хоз
		ON счет.орг_хоз_код = орг_хоз.орг_код
			ON опер.счет_код = счет.счет_код RIGHT JOIN dbo.фт_нач_опер_период(@Дата_с, @Дата_по) AS фт_нач_опер_период_1
			ON опер.опер_код = фт_нач_опер_период_1.опер_код GROUP BY счет.орг_хоз_код
			, стр.Стр_Код_Стат_4_тур
			, стр.стр_имя
			, стр.стр_код
	HAVING (счет.орг_хоз_код = @Орг_Хоз_код)
		AND (стр.стр_код <> 1)
	ORDER BY [Код строки]

	SELECT *
	, @Дата_с as Дата_с 
	, @Дата_по as Дата_по
	INTO [dbo].[я_Стат_4_тур_Таблица_3]
	FROM @TempTable
	ORDER BY [Код строки]
END

RETURN
	/*
	
	--	INTO [dbo].[я_Стат_4_тур_Таблица_3]
	SELECT TOP (100) PERCENT в_ана_нач.стр_имя AS Страна
		, SUM(в_ана_нач.нач_сум_1000) AS [Сумма тыс.руб.]
		, SUM(в_ана_нач.кол) AS человек
		, SUM(в_ана_нач.сут) AS сут
		, SUM(в_ана_нач.койко_суток) AS [койко-суток]
		, орг_хоз.орг_имя AS орг_хоз_имя
		, @Дата_с AS Дата_с
		, @Дата_по AS Дата_по
		, @Орг_Хоз_код AS Орг_Хоз_код
		, @Итого_тыс_руб AS Итого_тыс_руб
		, в_ана_нач.стр_СНГ
	FROM в_ана_нач
	LEFT JOIN орг_хоз
		ON в_ана_нач.орг_хоз_код = орг_хоз.орг_код
	WHERE (в_ана_нач.дата >= @Дата_с)
		AND (в_ана_нач.дата <= @Дата_по)
		AND (в_ана_нач.орг_хоз_код = @Орг_Хоз_код)
	GROUP BY в_ана_нач.стр_имя
		, орг_хоз.орг_имя
		, в_ана_нач.стр_СНГ
	ORDER BY Страна
	
	CREATE TABLE [dbo].[я_Стат_4_тур_Таблица_3](
	[Выручка] [numeric](20, 2) NULL,
	[Человек] [numeric](20, 1) NULL,
	[койко_суток] [numeric](20, 1) NULL,
	[орг_имя_хоз] [char](50) NULL,
	[Стр_Код_Стат_4_тур] [int] NULL
) ON [PRIMARY]
	*/
GO