SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO


-- =============================================
-- Author:		МАГ
-- Create date:
-- Description:
-- =============================================
CREATE PROCEDURE [dbo].[Отчеты_Стат_12_вэс_таблица_1]
	-- отбор по дому и сортировка
	@Дата_с DATE
	, @Дата_по DATE
	, @Орг_Хоз_код INT
	, @Курс_Долл NUMERIC(10, 4) = 2.0
AS
BEGIN
	-- SET NOCOUNT ON added to prevent extra result sets from
	-- interfering with SELECT statements.
	SET NOCOUNT ON;

	IF EXISTS (
			SELECT *
			FROM sys.objects
			WHERE object_id = Object_id(N'[dbo].[я_Стат_12_вэс_таблица_1]')
				AND TYPE IN (N'U')
			)
		DROP TABLE [dbo].[я_Стат_12_вэс_таблица_1]

	DECLARE @Итого_тыс_руб NUMERIC(10, 4)
	DECLARE @Итого_тыс_долл_США NUMERIC(10, 4)

	SELECT @Итого_тыс_руб = SUM(нач_сум_1000)
		, @Итого_тыс_долл_США = SUM(нач_сум_1000)/ @Курс_Долл
	FROM в_ана_нач
	WHERE (в_ана_нач.дата >= @Дата_с)
		AND (в_ана_нач.дата <= @Дата_по)
		AND (в_ана_нач.орг_хоз_код = @Орг_Хоз_код)
		AND (в_ана_нач.стр_код <> 1)


	SELECT TOP (100) PERCENT в_ана_нач.стр_имя AS Страна
		, SUM(нач_сум_1000) as [Сумма тыс.руб.]
		, SUM(нач_сум_1000)/ @Курс_Долл  AS [Сумма тыс.долл.США]
		, орг_хоз.орг_имя AS орг_хоз_имя
		, @Дата_с AS Дата_с
		, @Дата_по AS Дата_по
		, @Орг_Хоз_код AS Орг_Хоз_код
		, @Курс_Долл AS Курс_Долл
		, @Итого_тыс_руб AS Итого_тыс_руб
		, @Итого_тыс_долл_США AS Итого_тыс_долл_США
	INTO [dbo].[я_Стат_12_вэс_таблица_1]
	FROM в_ана_нач
	LEFT JOIN орг_хоз
		ON в_ана_нач.орг_хоз_код = орг_хоз.орг_код
	WHERE (в_ана_нач.дата >= @Дата_с)
		AND (в_ана_нач.дата <= @Дата_по)
		AND (в_ана_нач.орг_хоз_код = @Орг_Хоз_код)
		AND (в_ана_нач.стр_код <> 1)
	GROUP BY в_ана_нач.стр_имя
		, орг_хоз.орг_имя
	ORDER BY Страна
END

RETURN

GO