SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
CREATE PROCEDURE [dbo].[счет_и] (@счет_код    INT,
                                @орг_хоз_код INT,
                                @орг_код     INT,
                                @счет_имя    varchar(500),
                                @док         INT,
                                @дата        DATE,
                                @инф_счет    TEXT,
                                @дог_код INT,
                                @счф_код INT,
                                 @тип_код INT
                                )
AS
  SET NOCOUNT OFF;

  UPDATE [счет]
  SET    [орг_хоз_код] = @орг_хоз_код,
         [орг_код] = @орг_код,
         [счет_имя] = @счет_имя,
         [док] = @док,
         [дата] = @дата,
         [инф_счет] = @инф_счет,
         [дог_код] = @дог_код,
         [счф_код] = @счф_код,
 [тип_код] = @тип_код
  WHERE  ( [счет_код] = @счет_код );

  SELECT счет_код,
         орг_хоз_код,
         орг_код,
         счет_имя,
         док,
         дата,
         инф_счет,
         дог_код,
         счф_код,
           тип_код
         
         
  FROM   счет
  WHERE  ( счет_код = @счет_код )
GO