SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
-- =============================================
-- Author:		MAG
-- Create date: 2011-08-15
-- Description:	отч
-- =============================================
CREATE PROCEDURE [dbo].[о_нач_акт]
-- Add the parameters for the stored procedure here
@счет_код INT
AS
  BEGIN
      SET NOCOUNT ON;

      IF EXISTS (SELECT *
                 FROM   sys.objects
                 WHERE  object_id = Object_id(N'[dbo].[я_нач_акт]')
                        AND TYPE IN ( N'U' ))
        DROP TABLE [dbo].[я_нач_акт]

      SELECT
        -- ОБЩЕЕ ПО СЧЕТУ
        во_счет.*,
        
      -- итоги по документу          
      Фт_нач_опл_сум_1.сум_пропись,
      Фт_нач_опл_сум_1.сут AS сут_сум,
      Фт_нач_опл_сум_1.ски_сум,
      Фт_нач_опл_сум_1.нач_сум,
      -- во_кли_счет
   
      во_кли_счет.кли_код,
      во_кли_счет.дата_зае,
      во_кли_счет.дата_вые,
      во_кли_счет.сут,
    
   dbo.Фс_телефоны_все_зак (орг_код) as телефоны,
      -- в ДЕТАЛИ разные варианты
      dbo.Фс_гра_пол(во_кли_счет.кли_код) AS гра_пол,
      dbo.Фс_гра_стр(во_кли_счет.кли_код) AS гра_стр,
      dbo.Фс_кли_имя_граж_срок(во_кли_счет.счет_код, во_кли_счет.кли_код) AS граж_срок
      INTO   я_нач_акт
      FROM   dbo.Фт_нач_опл_сум(@счет_код) AS Фт_нач_опл_сум_1
             RIGHT OUTER JOIN во_кли_счет
               ON Фт_нач_опл_сум_1.счет_код = во_кли_счет.счет_код
             LEFT OUTER JOIN во_счет
               ON во_кли_счет.счет_код = во_счет.счет_код
      WHERE  во_кли_счет.счет_код = @счет_код
  END
GO