SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
CREATE PROCEDURE [dbo].[Пара_гру_пол] (@комп_код INT,
                                      @опер_код INT)
AS
  DECLARE @дата_зае    DATETIME,
          @дата_вые    DATETIME,
          @сут         INT,
          @тип_зае_код INT,
          @кол_взр     INT,
          @цель_код    INT,
          @ски_код     INT,
          @ски_про     INT,
          @счет_код    INT

  SELECT
    @дата_зае = дата_зае_г,
    @дата_вые = дата_вые_г,
    @сут = сут_г,
    @тип_зае_код = тип_зае_код_г,
    @кол_взр = кол_взр_г,
    @цель_код = цель_код_г,
    @ски_код = ски_код_г,
    @ски_про = ски_про_г,
    @счет_код = счет_код_г
  FROM
    пара
  WHERE  [комп_код] = @комп_код

  UPDATE [опер]
  SET    [счет_код] = @счет_код,
         [дата_зае] = @дата_зае,
         [дата_вые] = @дата_вые,
         [сут] = @сут,
         [тип_зае_код] = @тип_зае_код,
         [кол_взр] = @кол_взр,
         [цель_код] = @цель_код,
         [ски_код] = @ски_код,
         [ски_про] = @ски_про
  WHERE  опер_код = @опер_код
GO