SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
CREATE PROCEDURE [dbo].[нач_н]
(
	@опер_код int,
	@дата date,
	@мест int,
	@дкр int,
	@сут numeric(5,1),
	@ски_код int,
	@ски_про int,
	@про_сум numeric(12,2),
	@дкр_сум numeric(12,2),
	@тел_сум numeric(12,2),
	@бар_сум numeric(12,2),
	@ски_сум numeric(12,2),
	@у_1_сум numeric(12,2),
	@у_2_сум numeric(12,2),
	@у_3_сум numeric(12,2),
	@инф_нач text
)
AS
	SET NOCOUNT OFF;
    
    INSERT INTO [нач]
                ([опер_код],
                 [дата],
                 [мест],
                 [дкр],
                 [сут],
                 [ски_код],
                 [ски_про],
                 [про_сум],
                 [дкр_сум],
                 [тел_сум],
                 [бар_сум],
                 [ски_сум],
                 [у_1_сум],
                 [у_2_сум],
                 [у_3_сум],
                 [инф_нач])
    VALUES      (@опер_код,
                 @дата,
                 @мест,
                 @дкр,
                 @сут,
                 @ски_код,
                 @ски_про,
                 @про_сум,
                 @дкр_сум,
                 @тел_сум,
                 @бар_сум,
                 @ски_сум,
                 @у_1_сум,
                 @у_2_сум,
                 @у_3_сум,
                 @инф_нач);
    
    SELECT опер_код,
           дата,
           [мест],
                 [дкр],
                 [сут],
                 [ски_код],
           ски_про,
           про_сум,
           дкр_сум,
           тел_сум,
           бар_сум,
           ски_сум,
           у_1_сум,
           у_2_сум,
           у_3_сум,
           инф_нач
    FROM   нач
    WHERE  ( дата = @дата )
           AND ( опер_код = @опер_код )
GO