SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
-- =============================================
-- Author:		MAG
-- Create date: 2011-08-15
-- Description:	отч
-- =============================================
CREATE PROCEDURE [dbo].[о_кли]
-- Add the parameters for the stored procedure here
@счет_код INT,
@кли_код  INT
AS
  BEGIN
      SET NOCOUNT ON;

      IF EXISTS (SELECT
                   *
                 FROM
                   sys.objects
                 WHERE  object_id = Object_id(N'[dbo].[я_кли]')
                    AND TYPE IN ( N'U' ))
        DROP TABLE [dbo].[я_кли];

      SELECT
        во_кли_счет.счет_код,
        во_кли_счет.кли_код,
        во_кли_счет.ном_код,
        во_кли_счет.ски_про,
        во_кли_счет.ски_код,
        во_кли_счет.рег,
        во_кли_счет.дата_зае,
        во_кли_счет.дата_вые,
        во_кли_счет.сут,
        во_кли_счет.виза_сер,
        во_кли_счет.виза_номер,
        во_кли_счет.виза_вид_код,
        во_кли_счет.виза_дата_с,
        во_кли_счет.виза_дата_по,
        во_кли_счет.страх_номер,
        во_кли_счет.страх_кем_код,
        во_кли_счет.страх_дата_с,
        во_кли_счет.страх_дата_по,
        во_кли_счет.гра_дата,
        во_кли_счет.гра_код,
        во_кли_счет.миг_карта,
        во_кли_счет.миг_карта_дата_с,
        во_кли_счет.миг_карта_дата_по,
        во_кли_счет.раб_прибыл,
        увед.счет_код_увед,
        увед.кли_код_увед,
        увед.фам,
        увед.имя,
        увед.отч,
        увед.имя_отч,
        увед.рожд_дата,
        увед.др_д,
        увед.др_м,
        увед.др_г,
        увед.пдс_д,
        увед.пдс_м,
        увед.пдс_г,
        увед.пдп_д,
        увед.пдп_м,
        увед.пдп_г,
        увед.дз_д,
        увед.дз_м,
        увед.дз_г,
        увед.дв_д,
        увед.дв_м,
        увед.дв_г,
        увед.пас_номер,
        увед.гражд,
        увед.пол,
        увед.виза_тип,
        увед.гра,
        dbo.Фс_фио_лат(@кли_код) AS фио_лат,
        dbo.Фс_фио(@кли_код) AS фио,
        dbo.Фс_фам_ио(@кли_код) AS фам_ио,
        dbo.Фс_адр_имя(@кли_код) AS адр_имя,
        dbo.Фс_паспорт(@кли_код) AS паспорт,
        dbo.Фс_виза(@счет_код, @кли_код) AS виза,
        dbo.Фс_страх(@счет_код, @кли_код) AS страх,
        dbo.Фс_мигр(@счет_код, @кли_код) AS мигр,
        dbo.Фс_гра(@счет_код, @кли_код) AS гран,
        во_счет.хоз_имя
      INTO            я_кли
      FROM
        во_счет
      INNER JOIN      во_кли_счет
        ON во_счет.счет_код = во_кли_счет.счет_код
      LEFT OUTER JOIN dbo.Фт_кли_увед(@счет_код, @кли_код) AS увед
        ON во_кли_счет.счет_код = увед.счет_код_увед
           AND во_кли_счет.кли_код = увед.кли_код_увед
      WHERE           ( во_кли_счет.счет_код = @счет_код
                    AND во_кли_счет.кли_код = @кли_код )
  END
GO