SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
CREATE PROCEDURE [dbo].[счет_н] (@орг_хоз_код INT,
                                @орг_код     INT,
                                @счет_имя    VARCHAR(500),
                                @док         INT,
                                @дата        DATE,
                                @дог_код     INT,
                                @счф_код     INT,
                                @тип_код     INT
                                )
AS
  SET NOCOUNT OFF;

  INSERT INTO [счет]
              ([орг_хоз_код],
               [орг_код],
               [счет_имя],
               [док],
               [дата],
               [дог_код],
               [счф_код],
               [тип_код]
               )
  VALUES      (@орг_хоз_код,
               @орг_код,
               @счет_имя,
               @док,
               @дата,
               @дог_код,
               @счф_код ,
               @тип_код 
               );

  SELECT
    счет_код,
    орг_хоз_код,
    орг_код,
    счет_имя,
    док,
    дата,
    дог_код,
    счф_код,
    тип_код
  FROM
    счет
  WHERE  ( счет_код = Scope_identity() )
GO