SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
-- =============================================
-- Author:		MAG
-- Create date: 2011-08-15
-- Description:	отч
-- =============================================
CREATE  PROCEDURE [dbo].[о_счф]
-- Add the parameters for the stored procedure here
@счф_код INT
AS
  BEGIN
      SET NOCOUNT ON;

      IF EXISTS (SELECT *
                 FROM   sys.objects
                 WHERE  object_id = Object_id(N'[dbo].[я_счф]')
                        AND TYPE IN ( N'U' ))
        DROP TABLE [dbo].[я_счф]

      
   SELECT
     счф.счф_код,
     счф.счф_док,
     счф.счф_дата,
     счф.счф_сум,
     счф.счф_ном,
     счф.счф_сут,
     счф.опл_дата,
     счф.опл_док,
     счф.счф_цена,
     счф.счф_инф,
     счф.дата_с,
     счф.дата_по,
     счф.счф_ски,
      счф.счф_итого,
     счф.дог_код,
     дог.дог_дата,
     дог.дог_ном,
     дог.дог_с,
     дог.дог_по,
     дог.дог_хоз,
     дог.дог_орг,
     дог.дог_вид_код,
     дог.дог_ски,
     дог.дог_сумма,
     дог.дог_инф,
    

   dbo.Фс_счф_итого(счф.счф_код) as сум_итого_про,
     во_орг.*,
     во_хоз.*
  INTO я_счф
  
   FROM
     дог
   INNER JOIN      счф
     ON дог.дог_код = счф.дог_код
   LEFT OUTER JOIN во_орг
     ON дог.дог_орг = во_орг.зак_код
   LEFT OUTER JOIN во_хоз
     ON дог.дог_хоз = во_хоз.хоз_код 
   
        
 
  WHERE счф_код = @счф_код
 
 /*       
      -- итоги по документу          
      Фт_нач_опл_сум_1.сум_пропись,
      Фт_нач_опл_сум_1.сут AS сут_сум,
      Фт_нач_опл_сум_1.ски_сум,
      Фт_нач_опл_сум_1.нач_сум,
      -- во_кли_счет
   
      во_кли_счет.кли_код,
      во_кли_счет.дата_зае,
      во_кли_счет.дата_вые,
      во_кли_счет.сут,
    
      -- в ДЕТАЛИ разные варианты
      dbo.Фс_гра_пол(во_кли_счет.кли_код) AS гра_пол,
      dbo.Фс_гра_стр(во_кли_счет.кли_код) AS гра_стр,
      dbo.Фс_кли_имя_граж_срок(во_кли_счет.счет_код, во_кли_счет.кли_код) AS граж_срок
      INTO   я_счф
      FROM   dbo.Фт_нач_опл_сум(@счет_код) AS Фт_нач_опл_сум_1
             RIGHT OUTER JOIN во_кли_счет
               ON Фт_нач_опл_сум_1.счет_код = во_кли_счет.счет_код
             LEFT OUTER JOIN во_счет
               ON во_кли_счет.счет_код = во_счет.счет_код
      WHERE  во_кли_счет.счет_код = @счет_код
 
 
 */
 
  END
GO