SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
CREATE PROCEDURE [dbo].[усл_цена_н] (
@усл_цена_код INT,
@усл_код    INT,
                                    @усл_дата_с DATE,
                                    @тип_код    INT,
                                    @цена_1     DECIMAL(9, 0),
                                    @цена_2     DECIMAL(9, 0),
                                    @цена_3     DECIMAL(9, 0),
                                    @цена_7     DECIMAL(9, 0))
AS
  SET NOCOUNT ON;

  INSERT INTO [усл_цена]
              (усл_код,
               усл_дата_с,
               тип_код,
               цена_1,
               цена_2,
               цена_3,
               цена_7)
  VALUES      ( @усл_код,
                @усл_дата_с,
                @тип_код,
                @цена_1,
                @цена_2,
                @цена_3,
                @цена_7 )

  SELECT
усл_цена_код,
    усл_код,
    усл_дата_с,
    тип_код,
    цена_1,
    цена_2,
    цена_3,
    цена_7
  FROM
    усл_цена
  ORDER  BY
    усл_код,
    усл_дата_с,
    тип_код
GO