SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
CREATE PROCEDURE [dbo].[дог_и] (@дог_код     INT,
                               @дог_дата    DATE,
                               @дог_ном    bigint,
                               @дог_с       DATE,
                               @дог_по      DATE,
                               @дог_хоз     INT,
                               @дог_орг     INT,
                               @дог_вид_код INT,
                               @дог_ски     INT,
                               @дог_сумма   BIGINT,
                               @дог_инф     TEXT)
AS
  SET NOCOUNT OFF;

  UPDATE [дог]
  SET   
         [дог_дата] = @дог_дата,
         [дог_ном] = @дог_ном,
         [дог_с] = @дог_с,
         [дог_по] = @дог_по,
         [дог_хоз] = @дог_хоз,
         [дог_орг] = @дог_орг,
         [дог_вид_код] = @дог_вид_код,
         [дог_ски] = @дог_ски,
         [дог_сумма] = @дог_сумма,
         [дог_инф] = @дог_инф
  WHERE  [дог_код] = @дог_код;

  SELECT
    дог_код,
    дог_дата,
    дог_ном,
    дог_с,
    дог_по,
    дог_хоз,
    дог_орг,
    дог_вид_код,
    дог_ски,
    дог_сумма,
    дог_инф
  FROM
    дог
  WHERE  ( дог_код = @дог_код )
GO