SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
-- =============================================
-- Author:		MAG
-- Create date: 2011-08-15
-- Description:	отч
-- =============================================
CREATE PROCEDURE [dbo].[о_нач_опер_дата]
-- Add the parameters for the stored procedure here
@счет_код INT
AS
  BEGIN
      SET NOCOUNT ON;

      IF EXISTS (SELECT *
                 FROM   sys.objects
                 WHERE  object_id = Object_id(N'[dbo].[я_нач_опер_дата]')
                        AND TYPE IN ( N'U' ))
        DROP TABLE [dbo].[я_нач_опер_дата]

     SELECT во_нач_опер_дата.дата AS дата_опер,
            во_нач_опер_дата.мест,
            во_нач_опер_дата.кол,
            во_нач_опер_дата.дкр,
            во_нач_опер_дата.сут,
            во_нач_опер_дата.цена,
            во_нач_опер_дата.ски_про,
            во_нач_опер_дата.про_сум,
            во_нач_опер_дата.дкр_сум,
            во_нач_опер_дата.тел_сум,
            во_нач_опер_дата.бар_сум,
            во_нач_опер_дата.ски_сум AS ски_сум_опер,
            во_нач_опер_дата.у_1_сум,
            во_нач_опер_дата.у_2_сум,
            во_нач_опер_дата.у_3_сум,
            во_нач_опер_дата.инф_нач,
            во_нач_опер_дата.нач_сум AS нач_сум_опер,
            во_нач_опер_дата.ски_имя,
            во_нач_опер_дата.опер_имя,
            во_нач_опер_дата.счет_код,
            во_счет.счет_имя,
            во_счет.док,
            во_счет.дата,
            во_счет.хоз_имя_кор,
            во_счет.хоз_имя_пол,
            Фт_нач_опл_сум_1.сум_пропись,
            Фт_нач_опл_сум_1.сут AS сут_сум,
            Фт_нач_опл_сум_1.ски_сум,
            Фт_нач_опл_сум_1.нач_сум
     INTO   я_нач_опер_дата
     FROM   dbo.Фт_нач_опл_сум(@счет_код) AS Фт_нач_опл_сум_1
            RIGHT OUTER JOIN во_нач_опер_дата
              ON Фт_нач_опл_сум_1.счет_код = во_нач_опер_дата.счет_код
            LEFT OUTER JOIN во_счет
              ON во_нач_опер_дата.счет_код = во_счет.счет_код
     WHERE  ( во_нач_опер_дата.счет_код = @счет_код ) 
     
  END
GO