SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
CREATE PROCEDURE [dbo].[счф_н] (@счф_док   INT,
                               @счф_дата  DATE,
                               @счф_сум   numeric(12,2),
                               @счф_ном   INT,
                               @счф_сут   INT,
                               @опл_дата  DATE,
                               @опл_док   VARCHAR(50),
                               @счф_цена  numeric(12,2),
                               @счф_инф   VARCHAR(50),
                               @дог_код   INT,
                               @дата_с    DATE,
                               @дата_по   DATE,
                               @счф_ски   numeric(12,2),
                               @счф_итого numeric(12,2))
AS
  SET NOCOUNT OFF;

  INSERT INTO [счф]
              ([счф_док],
               [счф_дата],
               [счф_сум],
               [счф_ном],
               [счф_сут],
               [опл_дата],
               [опл_док],
               [счф_цена],
               [счф_инф],
               [дог_код],
               [дата_с],
               [дата_по],
               [счф_ски],
               [счф_итого])
  VALUES      (@счф_док,
               @счф_дата,
               @счф_сум,
               @счф_ном,
               @счф_сут,
               @опл_дата,
               @опл_док,
               @счф_цена,
               @счф_инф,
               @дог_код,
               @дата_с,
               @дата_по,
               @счф_ски,
               @счф_итого);

  SELECT
    счф_код,
    счф_док,
    счф_дата,
    счф_сум,
    счф_ном,
    счф_сут,
    опл_дата,
    опл_док,
    счф_цена,
    счф_инф,
    дог_код,
    дата_с,
    дата_по,
    счф_ски,
    счф_итого
  FROM
    счф
  WHERE  ( счф_код = Scope_identity() )
GO