SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
CREATE PROCEDURE [dbo].[нач_и] 
(
	@опер_код int,
	@нач_код int,
	@дата date,
	@мест int,
@кол int,
@дкр int,
	@сут int,
	@ски_код int,
	@ски_про int,
	@про_сум numeric(12,2),
	@дкр_сум numeric(12,2),
	@тел_сум numeric(12,2),
	@бар_сум numeric(12,2),
	@ски_сум numeric(12,2),
	@у_1_сум numeric(12,2),
	@у_2_сум numeric(12,2),
	@у_3_сум numeric(12,2),
	@инф_нач text,
	@бл bit
)
AS
	SET NOCOUNT OFF;
    
    UPDATE [нач]
    SET    
           [мест] = @мест,
          [кол] = @кол, 
           [дкр] = @дкр,
           [сут] = @сут,
           [ски_код] = @ски_код,
           [ски_про] = @ски_про,
           [про_сум] = @про_сум,
           [дкр_сум] = @дкр_сум,
           [тел_сум] = @тел_сум,
          
          /* [бар_сум] = @бар_сум,*/
          [бар_сум] = dbo.Фс_бар_сумма_счет_день(опер_код,дата),
          
           [ски_сум] = @ски_сум,
           [у_1_сум] = @у_1_сум,
           [у_2_сум] = @у_2_сум,
           [у_3_сум] = @у_3_сум,
           [инф_нач] = @инф_нач,
           [бл] = @бл
           
    WHERE   ( [нач_код] = @нач_код );
   
   SELECT нач.дата,
         isnull(нач.мест,1) as мест,
         isnull(нач.кол,0) as кол,
         isnull(нач.дкр,0) as дкр,
          
         isnull(нач.сут,1) as сут,
         isnull(нач.ски_код,0) as ски_код,
         isnull(нач.ски_про,0) as ски_про,
         isnull(нач.про_сум,0) as про_сум,
         isnull(нач.дкр_сум,0) as дкр_сум,
         isnull(нач.тел_сум,0) as тел_сум,
         isnull(нач.бар_сум,0) as бар_сум,
         isnull(нач.ски_сум,0) as ски_сум,
         isnull(нач.у_1_сум,0) as у_1_сум,
         isnull(нач.у_2_сум,0) as у_2_сум,
         isnull(нач.у_3_сум,0) as у_3_сум,
         нач.инф_нач  ,
         нач.опер_код,
         нач.нач_код
        
  FROM   нач
  WHERE  ( нач.опер_код = @опер_код )
GO