SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
CREATE PROCEDURE [dbo].[о_дог]
  -- Add the parameters for the stored procedure here
  @дог_код INT =969
AS
  BEGIN
      SET NOCOUNT ON;

      IF EXISTS (SELECT *
                 FROM   sys.objects
                 WHERE  object_id = Object_id(N'[dbo].[я_дог]')
                        AND TYPE IN ( N'U' ))
        DROP TABLE [dbo].[я_дог]

      SELECT дог_вид.дог_вид_имя,
             дог.дог_код,
             дог.дог_дата,
             дог.дог_ном,
             дог.дог_с,
             дог.дог_по,
             дог.дог_хоз,
             дог.дог_орг,
             дог.дог_вид_код,
             дог.дог_ски,
             дог.дог_сумма,
             дог.дог_инф,
             dbo.Фс_преамбула_дог(@дог_код)                    AS дог_преамбула,
             dbo.Фс_сумма_пропись_РубКоп(Isnull(дог.дог_сумма, 0)) AS дог_сум_про,
             во_хоз.хоз_код,
             во_хоз.хоз_имя,
             во_хоз.хоз_имя_1,
             во_хоз.хоз_имя_2,
             во_хоз.хоз_имя_3,
             во_хоз.хоз_имя_4,
             во_хоз.хоз_имя_пол,
             во_хоз.хоз_имя_кор,
             во_хоз.хоз_преамбула,
             во_хоз.хоз_счет_номер,
             во_хоз.хоз_счет_мфо,
             во_хоз.хоз_счет_банк,
             во_хоз.хоз_счет_банк_адр,
             во_хоз.хоз_банк_унп,
             во_хоз.хоз_унп,
             во_хоз.хоз_адрес,
             во_хоз.хоз_страна,
             во_хоз.хоз_рук_фио_кор,
             во_хоз.хоз_рук_фио_пол,
             во_хоз.хоз_рук_должность,
             во_хоз.хоз_дейст_на_осн,
             во_хоз.хоз_тел,
             во_хоз.хоз_факс,
             во_орг.зак_код,
             во_орг.зак_имя,
             во_орг.зак_имя_пол,
             во_орг.зак_имя_кор,
             во_орг.зак_преамбула,
             во_орг.зак_дейст_на_осн,
             во_орг.зак_счет_номер,
             во_орг.зак_счет_мфо,
             во_орг.зак_счет_банк,
             во_орг.зак_унп,
             во_орг.зак_город,
             во_орг.зак_адрес,
             во_орг.зак_рук_должность,
             во_орг.зак_рук_фио_пол,
             во_орг.зак_рук_фио_кор,
             во_орг.зак_тел_рук,
             во_орг.зак_контакт_фио,
             во_орг.зак_тел_контакт,
             во_орг.зак_тел_факс,
             CONVERT(datetime, '31.12.2017  23:59:59') as Дата_Окончания_Договора
     INTO [dbo].[я_дог]
	 FROM   дог
             LEFT OUTER JOIN дог_вид
                          ON дог.дог_вид_код = дог_вид.дог_вид_код
             LEFT OUTER JOIN во_хоз
                          ON дог.дог_хоз = во_хоз.хоз_код
             LEFT OUTER JOIN во_орг
                          ON дог.дог_орг = во_орг.зак_код
           
      WHERE  ( дог.дог_код = @дог_код )
  END
GO