SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
CREATE PROCEDURE [dbo].[дог_о]
--(@дог_код int )
AS
  SET NOCOUNT ON;

  SELECT
    орг_хоз.орг_имя     AS хоз,
    орг.орг_имя         AS организация,
    дог_вид.дог_вид_имя AS вид,
    дог.дог_ски       ,
    дог.дог_ном,
    дог.дог_дата,
    дог.дог_с,
    дог.дог_по,
    дог.дог_инф,
    дог.дог_сумма,
    дог.дог_код,
    дог.дог_хоз,
    дог.дог_орг,
    дог.дог_вид_код,
    дог.было
  FROM
    дог
    LEFT OUTER JOIN дог_вид
      ON дог.дог_вид_код = дог_вид.дог_вид_код
    LEFT OUTER JOIN орг
      ON дог.дог_орг = орг.орг_код
    LEFT OUTER JOIN орг_хоз
      ON дог.дог_хоз = орг_хоз.орг_код
--where дог_код = @дог_код
GO