SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
-- =============================================
-- Author:		MAG
-- Create date: 2011-05-22
-- Description:	 Используется она Это полу жесткая есть bl генерация записей - удаление и формирование новых
-- =============================================
CREATE PROCEDURE [dbo].[нач_ген]
-- Add the parameters for the stored procedure here
@опер_код    INT,
@ном_код     INT,
@дата_зае    DATE,
@дата_вые    DATE,
@пол_сут_зае BIT,
@пол_сут_вые BIT,
@сут         NUMERIC (5, 1),
@сут_пол     NUMERIC (3, 1),
@мест        INT,
@дкр         numeric(12,2),
@ски_про     INT,
@ски_код     INT,
@цена        numeric(12,2),
@цена_изм    BIT
AS
  BEGIN
      DECLARE @дата_нач DATE = @дата_зае;
      DECLARE @дата_кон DATE = @дата_вые;
      DECLARE @дата DATE;
      --     DECLARE @дд INT;
      DECLARE @есть INT;
      DECLARE @кол INT;
      DECLARE @про_сум numeric(12,2);
      DECLARE @дкр_сум numeric(12,2);
      DECLARE @ски_сум numeric(12,2);
      DECLARE @сут_вид NUMERIC (5, 1); -- или 1 или 0,5  
      -- пол сут перед датой зае
      IF @пол_сут_зае = 1
        BEGIN
            IF @сут != 0.5
              SET @дата_нач = Dateadd(DAY, -1, @дата_зае);
        END

      IF @пол_сут_вые = 1
        BEGIN
            IF @сут != 0.5
              SET @дата_кон = Dateadd(DAY, 1, @дата_вые);
        END

      SET @дата = @дата_нач;
      --   SET @дд =0;
      SET @сут_вид = 1

      SELECT @кол = кол
      FROM   мест
      WHERE  мест_код = @мест

      DELETE FROM нач
      WHERE  опер_код = @опер_код
             AND дата >= @дата_кон

      DELETE FROM нач
      WHERE  опер_код = @опер_код
             AND дата < @дата_нач

      WHILE ( @дата < @дата_кон
               OR @сут = 0.5 )
        BEGIN
            SET @сут = 0 -- это пусто только сброс 
            SET @сут_вид = 1

            IF @дата = @дата_нач
              BEGIN
                  IF @пол_сут_зае = 1 -- @дата_нач < @дата_зае
                    SET @сут_вид = 0.5
              END

            IF @дата = Dateadd(d, -1, @дата_кон)
              BEGIN
                  IF @пол_сут_вые = 1 --@дата_кон > @дата_вые 
                    SET @сут_вид = 0.5
              END

            -- это расчет цены если цена меняется во время проживания
            IF @цена_изм = 1
              SET @про_сум = @цена * @сут_вид;
            ELSE
              BEGIN
                  SET @цена = dbo.Фс_ном_цена(@ном_код, @дата, 1, @мест);
                  SET @про_сум = @цена * @сут_вид; -- она бала = 0;
 -- изменяется цена только для раздельного проживания            
                  IF @мест = 3 /* В  счетах проживания, если проживают два человека на раздельные спальные места в счете указывает сумму как 360 000 за номер, а должно быть 720 000. */
                    SET @цена = @цена * 2
             
              END

            SET @дкр_сум = dbo.Фс_ном_цена(@ном_код, @дата, 2, 1) * Isnull(@дкр, 0);
            SET @ски_сум = ( @про_сум + @дкр_сум ) * @ски_про / 100;

            EXEC dbo.Нач_ген_запись
              @опер_код,
              @дата,
              @мест,
              @дкр,
              @сут_вид,
              @кол,
              @цена,
              @про_сум,
              @дкр_сум,
              @ски_код,
              @ски_про,
              @ски_сум

            SET @дата = Dateadd(DAY, 1, @дата);
        END
  END
-- AND дата = Dateadd(D, -1, @дата_кон)
GO