SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO

-- =============================================
-- Author:		МАГ
-- Create date:
-- Description:
-- =============================================
CREATE PROCEDURE [dbo].[Отчеты_Стат_4_тур_Таблица_3_Детали]
	-- отбор по дому и сортировка
	@Дата_с DATE
	, @Дата_по DATE
	--	, @Орг_Хоз_код INT
AS
BEGIN
	-- SET NOCOUNT ON added to prevent extra result sets from
	-- interfering with SELECT statements.
	SET NOCOUNT ON;

	IF EXISTS (
			SELECT *
			FROM sys.objects
			WHERE object_id = Object_id(N'[dbo].[я_Стат_4_тур_Таблица_3_Детали]')
				AND TYPE IN (N'U')
			)
		DROP TABLE [dbo].[я_Стат_4_тур_Таблица_3_Детали]

	SELECT        TOP (100) PERCENT стр.стр_имя, стр.Стр_Код_Стат_4_тур AS [Код строки], фт_нач_опер_период_1.нач_сум AS Выручка, фт_нач_опер_период_1.кол AS Человек, фт_нач_опер_период_1.койко_суток, 
                         орг_хоз.орг_имя AS орг_имя_хоз, опер.дз_МЕС, фт_нач_опер_период_1.дата_min, фт_нач_опер_период_1.дата_max, фт_нач_опер_период_1.ски_сум, фт_нач_опер_период_1.опер_код, 
                         фт_нач_опер_период_1.сут_Период, фт_нач_опер_период_1.сут_Всего, фт_нач_опер_период_1.кол_взр, фт_нач_опер_период_1.кол_дет, орг.орг_имя, орг.орг_имя_пол, кли.ФИО, счет.счет_имя, 
                         счет.орг_код, счет.орг_хоз_код, опер.дз_ГОД, фт_нач_опер_период_1.д_год, фт_нач_опер_период_1.д_мес, счет.тип_код, стр.СНГ
INTO              я_Стат_4_тур_Таблица_3_Детали
FROM            орг_хоз RIGHT OUTER JOIN
                         счет LEFT OUTER JOIN
                         орг ON счет.орг_код = орг.орг_код ON орг_хоз.орг_код = счет.орг_хоз_код RIGHT OUTER JOIN
                         кли INNER JOIN
                         опер ON кли.кли_код = опер.кли_код INNER JOIN
                         стр ON кли.гражд_код = стр.стр_код ON счет.счет_код = опер.счет_код RIGHT OUTER JOIN
                         dbo.фт_нач_опер_период(@Дата_с, @Дата_по) AS фт_нач_опер_период_1 ON опер.опер_код = фт_нач_опер_период_1.опер_код
				--WHERE        (счет.орг_хоз_код = @Орг_Хоз_код) AND (стр.стр_код <> 1)
			END

	RETURN
		--WHERE        (счет.орг_хоз_код = @Орг_Хоз_код) AND (стр.стр_код <> 1)
GO