SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
-- =============================================
-- Author:		МАГ
-- Create date: 2011-05-22
-- Description:	
-- =============================================
CREATE FUNCTION [dbo].[Фт_мест_дата_з_глав_расчет] (
-- Add the parameters for the function here
@дата DATE)
RETURNS TABLE
AS
  RETURN
    (SELECT
       опер.опер_код,
       опер.ном_код,
       ном.НОМ,
       опер.кли_код,
       опер.счет_код,
       опер.дата_зае,
       опер.дата_вые,
       опер.сут,
       опер_тип_зае.тип_зае_имя AS вид,
       счет.тип_код AS вид_код,
       кли.ФИО,
       кли.фам,
       кли.имя,
       кли.отч,
       ном.мест,
       ном_тип.тип_имя,
       счет.счет_имя,
       счет.док,
       счет.дата,
       орг_хоз.орг_имя AS хоз,
       dbo.Фс_опер_имя(опер.опер_код) AS опер_имя,
        isnull(dbo.Фс_счет_имя_расчет(счет.счет_код),'') AS счет_имя_док,
        isnull(dbo.Фс_дог_имя(счет.дог_код),'') AS дог_имя,
        isnull(dbo.Фс_счф_имя(счет.счф_код),'') AS счф_имя,
       
       isnull(v_сум_нач.про_сум,0) as про_сум,
       isnull(v_сум_нач.дкр_сум,0) as дкр_сум,
       isnull(v_сум_нач.ски_сум,0) as ски_сум,
       isnull(v_сум_нач.нач_сум,0) as нач_сум,
      isnull( v_сум_опл.опл_сум,0) as опл_сум
     FROM
       v_сум_опл
     RIGHT OUTER JOIN опер
       ON v_сум_опл.опер_код = опер.опер_код
     LEFT OUTER JOIN  v_сум_нач
       ON опер.опер_код = v_сум_нач.опер_код
     LEFT OUTER JOIN  счет
                      LEFT OUTER JOIN орг_хоз
                        ON счет.орг_хоз_код = орг_хоз.орг_код
                      LEFT OUTER JOIN опер_тип_зае
                        ON счет.тип_код = опер_тип_зае.тип_зае_код
       ON опер.счет_код = счет.счет_код
     LEFT OUTER JOIN  ном_тип
                      INNER JOIN ном
                        ON ном_тип.тип_код = ном.тип_код
       ON опер.ном_код = ном.ном_код
     LEFT OUTER JOIN  кли
       ON опер.кли_код = кли.кли_код
     WHERE            ( @дата >= CONVERT(DATE, опер.дата_зае) )
                  AND ( @дата <= CONVERT(DATE, опер.дата_вые) ))
GO