SET QUOTED_IDENTIFIER, ANSI_NULLS ON
GO
-- =============================================
-- Author:		МАГ
-- Create date: 2011-05-22
-- Description:	
-- =============================================
CREATE FUNCTION [dbo].[Фт_мест_дата_з_глав] (
-- Add the parameters for the function here
@дата DATE)
RETURNS TABLE
AS
  RETURN
    (SELECT
       опер.опер_код,
       опер.ном_код,
       ном.НОМ,
       опер.кли_код,
       опер.счет_код,
       опер.дата_зае,
       опер.дата_вые,
       опер.сут,
       опер_тип_зае.тип_зае_имя AS вид,
       счет.тип_код AS вид_код ,
       
       кли.ФИО,
       кли.фам,
       кли.имя,
       кли.отч,
       ном.мест,
       ном_тип.тип_имя,
       счет.счет_имя,
       счет.док,
       счет.дата,
       орг_хоз.орг_имя AS хоз,
       dbo.Фс_опер_имя(опер.опер_код) AS опер_имя,
       dbo.Фс_счет_имя(счет.счет_код) AS счет_имя_док,
       dbo.Фс_дог_имя(счет.дог_код) AS дог_имя,
       dbo.Фс_счф_имя(счет.счф_код) AS счф_имя
     FROM
       счет
     LEFT OUTER JOIN  орг_хоз
       ON счет.орг_хоз_код = орг_хоз.орг_код
     LEFT OUTER JOIN  опер_тип_зае
       ON счет.тип_код = опер_тип_зае.тип_зае_код
     RIGHT OUTER JOIN опер
       ON счет.счет_код = опер.счет_код
     LEFT OUTER JOIN  ном_тип
                      INNER JOIN ном
                        ON ном_тип.тип_код = ном.тип_код
       ON опер.ном_код = ном.ном_код
     LEFT OUTER JOIN  кли
       ON опер.кли_код = кли.кли_код
     WHERE            ( @дата >= CONVERT(DATE, опер.дата_зае) )
                  AND ( @дата <= CONVERT(DATE, опер.дата_вые) ))
GO